grevaillot/svd_tools/headers/ATSAMR35J17B/port.h
/** @defgroup port_dir0 DIR0 Data Direction
@{*/


#define PORT_DIR0_DIR_SHIFT		0
#define PORT_DIR0_DIR_MASK		0xffffffff
/** @defgroup port_dir0_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirclr0 DIRCLR0 Data Direction Clear
@{*/


#define PORT_DIRCLR0_DIRCLR_SHIFT		0
#define PORT_DIRCLR0_DIRCLR_MASK		0xffffffff
/** @defgroup port_dirclr0_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirset0 DIRSET0 Data Direction Set
@{*/


#define PORT_DIRSET0_DIRSET_SHIFT		0
#define PORT_DIRSET0_DIRSET_MASK		0xffffffff
/** @defgroup port_dirset0_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirtgl0 DIRTGL0 Data Direction Toggle
@{*/


#define PORT_DIRTGL0_DIRTGL_SHIFT		0
#define PORT_DIRTGL0_DIRTGL_MASK		0xffffffff
/** @defgroup port_dirtgl0_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_out0 OUT0 Data Output Value
@{*/


#define PORT_OUT0_OUT_SHIFT		0
#define PORT_OUT0_OUT_MASK		0xffffffff
/** @defgroup port_out0_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outclr0 OUTCLR0 Data Output Value Clear
@{*/


#define PORT_OUTCLR0_OUTCLR_SHIFT		0
#define PORT_OUTCLR0_OUTCLR_MASK		0xffffffff
/** @defgroup port_outclr0_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outset0 OUTSET0 Data Output Value Set
@{*/


#define PORT_OUTSET0_OUTSET_SHIFT		0
#define PORT_OUTSET0_OUTSET_MASK		0xffffffff
/** @defgroup port_outset0_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outtgl0 OUTTGL0 Data Output Value Toggle
@{*/


#define PORT_OUTTGL0_OUTTGL_SHIFT		0
#define PORT_OUTTGL0_OUTTGL_MASK		0xffffffff
/** @defgroup port_outtgl0_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_in0 IN0 Data Input Value
@{*/


#define PORT_IN0_IN_SHIFT		0
#define PORT_IN0_IN_MASK		0xffffffff
/** @defgroup port_in0_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_ctrl0 CTRL0 Control
@{*/


#define PORT_CTRL0_SAMPLING_SHIFT		0
#define PORT_CTRL0_SAMPLING_MASK		0xffffffff
/** @defgroup port_ctrl0_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_wrconfig0 WRCONFIG0 Write Configuration
@{*/

/** PORT_WRCONFIG0_HWSEL Half-Word Select **/
#define PORT_WRCONFIG0_HWSEL		(1 << 31)
/** PORT_WRCONFIG0_WRPINCFG Write PINCFG Registers **/
#define PORT_WRCONFIG0_WRPINCFG		(1 << 30)
/** PORT_WRCONFIG0_WRPMUX Write PMUX Registers **/
#define PORT_WRCONFIG0_WRPMUX		(1 << 28)

#define PORT_WRCONFIG0_PMUX_SHIFT		24
#define PORT_WRCONFIG0_PMUX_MASK		0x0f
/** @defgroup port_wrconfig0_pmux PMUX Peripheral Multiplexing Template
@{*/
/**@}*/

/** PORT_WRCONFIG0_DRVSTR Output Driver Strength Selection **/
#define PORT_WRCONFIG0_DRVSTR		(1 << 22)
/** PORT_WRCONFIG0_PULLEN Pull Enable **/
#define PORT_WRCONFIG0_PULLEN		(1 << 18)
/** PORT_WRCONFIG0_INEN Input Enable **/
#define PORT_WRCONFIG0_INEN		(1 << 17)
/** PORT_WRCONFIG0_PMUXEN Select Peripheral Multiplexer **/
#define PORT_WRCONFIG0_PMUXEN		(1 << 16)

#define PORT_WRCONFIG0_PINMASK_SHIFT		0
#define PORT_WRCONFIG0_PINMASK_MASK		0xffff
/** @defgroup port_wrconfig0_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_evctrl0 EVCTRL0 Event Input Control
@{*/

/** PORT_EVCTRL0_PORTEI3 Port Event Enable Input 3 **/
#define PORT_EVCTRL0_PORTEI3		(1 << 31)

#define PORT_EVCTRL0_EVACT3_SHIFT		29
#define PORT_EVCTRL0_EVACT3_MASK		0x03
/** @defgroup port_evctrl0_evact3 EVACT3 Port Event Action 3
@{*/
/**@}*/


#define PORT_EVCTRL0_PID3_SHIFT		24
#define PORT_EVCTRL0_PID3_MASK		0x1f
/** @defgroup port_evctrl0_pid3 PID3 Port Event Pin Identifier 3
@{*/
/**@}*/

/** PORT_EVCTRL0_PORTEI2 Port Event Enable Input 2 **/
#define PORT_EVCTRL0_PORTEI2		(1 << 23)

#define PORT_EVCTRL0_EVACT2_SHIFT		21
#define PORT_EVCTRL0_EVACT2_MASK		0x03
/** @defgroup port_evctrl0_evact2 EVACT2 Port Event Action 2
@{*/
/**@}*/


#define PORT_EVCTRL0_PID2_SHIFT		16
#define PORT_EVCTRL0_PID2_MASK		0x1f
/** @defgroup port_evctrl0_pid2 PID2 Port Event Pin Identifier 2
@{*/
/**@}*/

/** PORT_EVCTRL0_PORTEI1 Port Event Enable Input 1 **/
#define PORT_EVCTRL0_PORTEI1		(1 << 15)

#define PORT_EVCTRL0_EVACT1_SHIFT		13
#define PORT_EVCTRL0_EVACT1_MASK		0x03
/** @defgroup port_evctrl0_evact1 EVACT1 Port Event Action 1
@{*/
/**@}*/


#define PORT_EVCTRL0_PID1_SHIFT		8
#define PORT_EVCTRL0_PID1_MASK		0x1f
/** @defgroup port_evctrl0_pid1 PID1 Port Event Pin Identifier 1
@{*/
/**@}*/

/** PORT_EVCTRL0_PORTEI0 Port Event Enable Input 0 **/
#define PORT_EVCTRL0_PORTEI0		(1 << 7)

#define PORT_EVCTRL0_EVACT0_SHIFT		5
#define PORT_EVCTRL0_EVACT0_MASK		0x03
/** @defgroup port_evctrl0_evact0 EVACT0 Port Event Action 0
@{*/
/**@}*/


#define PORT_EVCTRL0_PID0_SHIFT		0
#define PORT_EVCTRL0_PID0_MASK		0x1f
/** @defgroup port_evctrl0_pid0 PID0 Port Event Pin Identifier 0
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_0 PMUX00 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_0_PMUXO_SHIFT		4
#define PORT_PMUX0_0_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_0_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_PMUX0_0_PMUXE_SHIFT		0
#define PORT_PMUX0_0_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_0_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_1 PMUX01 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_1_PMUXO_SHIFT		4
#define PORT_PMUX0_1_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_1_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_PMUX0_1_PMUXE_SHIFT		0
#define PORT_PMUX0_1_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_1_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux0_2 PMUX02 Peripheral Multiplexing n - Group 0
@{*/


#define PORT_PMUX0_2_PMUXO_SHIFT		4
#define PORT_PMUX0_2_PMUXO_MASK		0x0f
/** @defgroup port_pmux0_2_pmuxo PMUXO Peripheral Multiplexing for Odd-Numbered Pin
@{*/
/**@}*/


#define PORT_PMUX0_2_PMUXE_SHIFT		0
#define PORT_PMUX0_2_PMUXE_MASK		0x0f
/** @defgroup port_pmux0_2_pmuxe PMUXE Peripheral Multiplexing for Even-Numbered Pin
@{*/
/**@}*/


/**@}*/

