grevaillot/svd_tools/headers/ATSAMR35J17B/port.h
/** @defgroup port_pincfg0_20 PINCFG020 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_20_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_20_DRVSTR		(1 << 6)
/** PORT_PINCFG0_20_PULLEN Pull Enable **/
#define PORT_PINCFG0_20_PULLEN		(1 << 2)
/** PORT_PINCFG0_20_INEN Input Enable **/
#define PORT_PINCFG0_20_INEN		(1 << 1)
/** PORT_PINCFG0_20_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_20_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_21 PINCFG021 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_21_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_21_DRVSTR		(1 << 6)
/** PORT_PINCFG0_21_PULLEN Pull Enable **/
#define PORT_PINCFG0_21_PULLEN		(1 << 2)
/** PORT_PINCFG0_21_INEN Input Enable **/
#define PORT_PINCFG0_21_INEN		(1 << 1)
/** PORT_PINCFG0_21_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_21_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_22 PINCFG022 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_22_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_22_DRVSTR		(1 << 6)
/** PORT_PINCFG0_22_PULLEN Pull Enable **/
#define PORT_PINCFG0_22_PULLEN		(1 << 2)
/** PORT_PINCFG0_22_INEN Input Enable **/
#define PORT_PINCFG0_22_INEN		(1 << 1)
/** PORT_PINCFG0_22_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_22_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_23 PINCFG023 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_23_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_23_DRVSTR		(1 << 6)
/** PORT_PINCFG0_23_PULLEN Pull Enable **/
#define PORT_PINCFG0_23_PULLEN		(1 << 2)
/** PORT_PINCFG0_23_INEN Input Enable **/
#define PORT_PINCFG0_23_INEN		(1 << 1)
/** PORT_PINCFG0_23_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_23_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_24 PINCFG024 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_24_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_24_DRVSTR		(1 << 6)
/** PORT_PINCFG0_24_PULLEN Pull Enable **/
#define PORT_PINCFG0_24_PULLEN		(1 << 2)
/** PORT_PINCFG0_24_INEN Input Enable **/
#define PORT_PINCFG0_24_INEN		(1 << 1)
/** PORT_PINCFG0_24_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_24_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_25 PINCFG025 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_25_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_25_DRVSTR		(1 << 6)
/** PORT_PINCFG0_25_PULLEN Pull Enable **/
#define PORT_PINCFG0_25_PULLEN		(1 << 2)
/** PORT_PINCFG0_25_INEN Input Enable **/
#define PORT_PINCFG0_25_INEN		(1 << 1)
/** PORT_PINCFG0_25_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_25_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_26 PINCFG026 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_26_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_26_DRVSTR		(1 << 6)
/** PORT_PINCFG0_26_PULLEN Pull Enable **/
#define PORT_PINCFG0_26_PULLEN		(1 << 2)
/** PORT_PINCFG0_26_INEN Input Enable **/
#define PORT_PINCFG0_26_INEN		(1 << 1)
/** PORT_PINCFG0_26_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_26_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_27 PINCFG027 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_27_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_27_DRVSTR		(1 << 6)
/** PORT_PINCFG0_27_PULLEN Pull Enable **/
#define PORT_PINCFG0_27_PULLEN		(1 << 2)
/** PORT_PINCFG0_27_INEN Input Enable **/
#define PORT_PINCFG0_27_INEN		(1 << 1)
/** PORT_PINCFG0_27_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_27_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_28 PINCFG028 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_28_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_28_DRVSTR		(1 << 6)
/** PORT_PINCFG0_28_PULLEN Pull Enable **/
#define PORT_PINCFG0_28_PULLEN		(1 << 2)
/** PORT_PINCFG0_28_INEN Input Enable **/
#define PORT_PINCFG0_28_INEN		(1 << 1)
/** PORT_PINCFG0_28_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_28_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_29 PINCFG029 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_29_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_29_DRVSTR		(1 << 6)
/** PORT_PINCFG0_29_PULLEN Pull Enable **/
#define PORT_PINCFG0_29_PULLEN		(1 << 2)
/** PORT_PINCFG0_29_INEN Input Enable **/
#define PORT_PINCFG0_29_INEN		(1 << 1)
/** PORT_PINCFG0_29_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_29_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_30 PINCFG030 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_30_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_30_DRVSTR		(1 << 6)
/** PORT_PINCFG0_30_PULLEN Pull Enable **/
#define PORT_PINCFG0_30_PULLEN		(1 << 2)
/** PORT_PINCFG0_30_INEN Input Enable **/
#define PORT_PINCFG0_30_INEN		(1 << 1)
/** PORT_PINCFG0_30_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_30_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_pincfg0_31 PINCFG031 Pin Configuration n - Group 0
@{*/

/** PORT_PINCFG0_31_DRVSTR Output Driver Strength Selection **/
#define PORT_PINCFG0_31_DRVSTR		(1 << 6)
/** PORT_PINCFG0_31_PULLEN Pull Enable **/
#define PORT_PINCFG0_31_PULLEN		(1 << 2)
/** PORT_PINCFG0_31_INEN Input Enable **/
#define PORT_PINCFG0_31_INEN		(1 << 1)
/** PORT_PINCFG0_31_PMUXEN Select Peripheral Multiplexer **/
#define PORT_PINCFG0_31_PMUXEN		(1 << 0)

/**@}*/

/** @defgroup port_dir1 DIR1 Data Direction
@{*/


#define PORT_DIR1_DIR_SHIFT		0
#define PORT_DIR1_DIR_MASK		0xffffffff
/** @defgroup port_dir1_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirclr1 DIRCLR1 Data Direction Clear
@{*/


#define PORT_DIRCLR1_DIRCLR_SHIFT		0
#define PORT_DIRCLR1_DIRCLR_MASK		0xffffffff
/** @defgroup port_dirclr1_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirset1 DIRSET1 Data Direction Set
@{*/


#define PORT_DIRSET1_DIRSET_SHIFT		0
#define PORT_DIRSET1_DIRSET_MASK		0xffffffff
/** @defgroup port_dirset1_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirtgl1 DIRTGL1 Data Direction Toggle
@{*/


#define PORT_DIRTGL1_DIRTGL_SHIFT		0
#define PORT_DIRTGL1_DIRTGL_MASK		0xffffffff
/** @defgroup port_dirtgl1_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_out1 OUT1 Data Output Value
@{*/


#define PORT_OUT1_OUT_SHIFT		0
#define PORT_OUT1_OUT_MASK		0xffffffff
/** @defgroup port_out1_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outclr1 OUTCLR1 Data Output Value Clear
@{*/


#define PORT_OUTCLR1_OUTCLR_SHIFT		0
#define PORT_OUTCLR1_OUTCLR_MASK		0xffffffff
/** @defgroup port_outclr1_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outset1 OUTSET1 Data Output Value Set
@{*/


