grevaillot/svd_tools/headers/ATSAMR35J17B/port.h
#define PORT_OUTSET1_OUTSET_SHIFT		0
#define PORT_OUTSET1_OUTSET_MASK		0xffffffff
/** @defgroup port_outset1_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outtgl1 OUTTGL1 Data Output Value Toggle
@{*/


#define PORT_OUTTGL1_OUTTGL_SHIFT		0
#define PORT_OUTTGL1_OUTTGL_MASK		0xffffffff
/** @defgroup port_outtgl1_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_in1 IN1 Data Input Value
@{*/


#define PORT_IN1_IN_SHIFT		0
#define PORT_IN1_IN_MASK		0xffffffff
/** @defgroup port_in1_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_ctrl1 CTRL1 Control
@{*/


#define PORT_CTRL1_SAMPLING_SHIFT		0
#define PORT_CTRL1_SAMPLING_MASK		0xffffffff
/** @defgroup port_ctrl1_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_wrconfig1 WRCONFIG1 Write Configuration
@{*/

/** PORT_WRCONFIG1_HWSEL Half-Word Select **/
#define PORT_WRCONFIG1_HWSEL		(1 << 31)
/** PORT_WRCONFIG1_WRPINCFG Write PINCFG Registers **/
#define PORT_WRCONFIG1_WRPINCFG		(1 << 30)
/** PORT_WRCONFIG1_WRPMUX Write PMUX Registers **/
#define PORT_WRCONFIG1_WRPMUX		(1 << 28)

#define PORT_WRCONFIG1_PMUX_SHIFT		24
#define PORT_WRCONFIG1_PMUX_MASK		0x0f
/** @defgroup port_wrconfig1_pmux PMUX Peripheral Multiplexing Template
@{*/
/**@}*/

/** PORT_WRCONFIG1_DRVSTR Output Driver Strength Selection **/
#define PORT_WRCONFIG1_DRVSTR		(1 << 22)
/** PORT_WRCONFIG1_PULLEN Pull Enable **/
#define PORT_WRCONFIG1_PULLEN		(1 << 18)
/** PORT_WRCONFIG1_INEN Input Enable **/
#define PORT_WRCONFIG1_INEN		(1 << 17)
/** PORT_WRCONFIG1_PMUXEN Select Peripheral Multiplexer **/
#define PORT_WRCONFIG1_PMUXEN		(1 << 16)

#define PORT_WRCONFIG1_PINMASK_SHIFT		0
#define PORT_WRCONFIG1_PINMASK_MASK		0xffff
/** @defgroup port_wrconfig1_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_evctrl1 EVCTRL1 Event Input Control
@{*/

/** PORT_EVCTRL1_PORTEI3 Port Event Enable Input 3 **/
#define PORT_EVCTRL1_PORTEI3		(1 << 31)

#define PORT_EVCTRL1_EVACT3_SHIFT		29
#define PORT_EVCTRL1_EVACT3_MASK		0x03
/** @defgroup port_evctrl1_evact3 EVACT3 Port Event Action 3
@{*/
/**@}*/


#define PORT_EVCTRL1_PID3_SHIFT		24
#define PORT_EVCTRL1_PID3_MASK		0x1f
/** @defgroup port_evctrl1_pid3 PID3 Port Event Pin Identifier 3
@{*/
/**@}*/

/** PORT_EVCTRL1_PORTEI2 Port Event Enable Input 2 **/
#define PORT_EVCTRL1_PORTEI2		(1 << 23)

#define PORT_EVCTRL1_EVACT2_SHIFT		21
#define PORT_EVCTRL1_EVACT2_MASK		0x03
/** @defgroup port_evctrl1_evact2 EVACT2 Port Event Action 2
@{*/
/**@}*/


#define PORT_EVCTRL1_PID2_SHIFT		16
#define PORT_EVCTRL1_PID2_MASK		0x1f
/** @defgroup port_evctrl1_pid2 PID2 Port Event Pin Identifier 2
@{*/
/**@}*/

/** PORT_EVCTRL1_PORTEI1 Port Event Enable Input 1 **/
#define PORT_EVCTRL1_PORTEI1		(1 << 15)

#define PORT_EVCTRL1_EVACT1_SHIFT		13
#define PORT_EVCTRL1_EVACT1_MASK		0x03
/** @defgroup port_evctrl1_evact1 EVACT1 Port Event Action 1
@{*/
/**@}*/


#define PORT_EVCTRL1_PID1_SHIFT		8
#define PORT_EVCTRL1_PID1_MASK		0x1f
/** @defgroup port_evctrl1_pid1 PID1 Port Event Pin Identifier 1
@{*/
/**@}*/

/** PORT_EVCTRL1_PORTEI0 Port Event Enable Input 0 **/
#define PORT_EVCTRL1_PORTEI0		(1 << 7)

#define PORT_EVCTRL1_EVACT0_SHIFT		5
#define PORT_EVCTRL1_EVACT0_MASK		0x03
/** @defgroup port_evctrl1_evact0 EVACT0 Port Event Action 0
@{*/
/**@}*/


#define PORT_EVCTRL1_PID0_SHIFT		0
#define PORT_EVCTRL1_PID0_MASK		0x1f
/** @defgroup port_evctrl1_pid0 PID0 Port Event Pin Identifier 0
@{*/
/**@}*/


/**@}*/

/** @defgroup port_pmux1_0 PMUX10 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_1 PMUX11 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_2 PMUX12 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_3 PMUX13 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_4 PMUX14 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_5 PMUX15 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_6 PMUX16 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_7 PMUX17 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_8 PMUX18 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_9 PMUX19 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_10 PMUX110 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_11 PMUX111 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_12 PMUX112 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_13 PMUX113 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_14 PMUX114 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pmux1_15 PMUX115 Peripheral Multiplexing n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_0 PINCFG10 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_1 PINCFG11 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_2 PINCFG12 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_3 PINCFG13 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_4 PINCFG14 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_5 PINCFG15 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_6 PINCFG16 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_7 PINCFG17 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_8 PINCFG18 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_9 PINCFG19 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_10 PINCFG110 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_11 PINCFG111 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_12 PINCFG112 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_13 PINCFG113 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_14 PINCFG114 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_15 PINCFG115 Pin Configuration n - Group 1
@{*/


/**@}*/

