grevaillot/svd_tools/headers/ATSAMR35J17B/port.h
/** @defgroup port_pincfg1_16 PINCFG116 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_17 PINCFG117 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_18 PINCFG118 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_19 PINCFG119 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_20 PINCFG120 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_21 PINCFG121 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_22 PINCFG122 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_23 PINCFG123 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_24 PINCFG124 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_25 PINCFG125 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_26 PINCFG126 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_27 PINCFG127 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_28 PINCFG128 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_29 PINCFG129 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_30 PINCFG130 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_pincfg1_31 PINCFG131 Pin Configuration n - Group 1
@{*/


/**@}*/

/** @defgroup port_dir2 DIR2 Data Direction
@{*/


#define PORT_DIR2_DIR_SHIFT		0
#define PORT_DIR2_DIR_MASK		0xffffffff
/** @defgroup port_dir2_dir DIR Port Data Direction
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirclr2 DIRCLR2 Data Direction Clear
@{*/


#define PORT_DIRCLR2_DIRCLR_SHIFT		0
#define PORT_DIRCLR2_DIRCLR_MASK		0xffffffff
/** @defgroup port_dirclr2_dirclr DIRCLR Port Data Direction Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirset2 DIRSET2 Data Direction Set
@{*/


#define PORT_DIRSET2_DIRSET_SHIFT		0
#define PORT_DIRSET2_DIRSET_MASK		0xffffffff
/** @defgroup port_dirset2_dirset DIRSET Port Data Direction Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_dirtgl2 DIRTGL2 Data Direction Toggle
@{*/


#define PORT_DIRTGL2_DIRTGL_SHIFT		0
#define PORT_DIRTGL2_DIRTGL_MASK		0xffffffff
/** @defgroup port_dirtgl2_dirtgl DIRTGL Port Data Direction Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_out2 OUT2 Data Output Value
@{*/


#define PORT_OUT2_OUT_SHIFT		0
#define PORT_OUT2_OUT_MASK		0xffffffff
/** @defgroup port_out2_out OUT Port Data Output Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outclr2 OUTCLR2 Data Output Value Clear
@{*/


#define PORT_OUTCLR2_OUTCLR_SHIFT		0
#define PORT_OUTCLR2_OUTCLR_MASK		0xffffffff
/** @defgroup port_outclr2_outclr OUTCLR Port Data Output Value Clear
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outset2 OUTSET2 Data Output Value Set
@{*/


#define PORT_OUTSET2_OUTSET_SHIFT		0
#define PORT_OUTSET2_OUTSET_MASK		0xffffffff
/** @defgroup port_outset2_outset OUTSET Port Data Output Value Set
@{*/
/**@}*/


/**@}*/

/** @defgroup port_outtgl2 OUTTGL2 Data Output Value Toggle
@{*/


#define PORT_OUTTGL2_OUTTGL_SHIFT		0
#define PORT_OUTTGL2_OUTTGL_MASK		0xffffffff
/** @defgroup port_outtgl2_outtgl OUTTGL Port Data Output Value Toggle
@{*/
/**@}*/


/**@}*/

/** @defgroup port_in2 IN2 Data Input Value
@{*/


#define PORT_IN2_IN_SHIFT		0
#define PORT_IN2_IN_MASK		0xffffffff
/** @defgroup port_in2_in IN Port Data Input Value
@{*/
/**@}*/


/**@}*/

/** @defgroup port_ctrl2 CTRL2 Control
@{*/


#define PORT_CTRL2_SAMPLING_SHIFT		0
#define PORT_CTRL2_SAMPLING_MASK		0xffffffff
/** @defgroup port_ctrl2_sampling SAMPLING Input Sampling Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup port_wrconfig2 WRCONFIG2 Write Configuration
@{*/

/** PORT_WRCONFIG2_HWSEL Half-Word Select **/
#define PORT_WRCONFIG2_HWSEL		(1 << 31)
/** PORT_WRCONFIG2_WRPINCFG Write PINCFG Registers **/
#define PORT_WRCONFIG2_WRPINCFG		(1 << 30)
/** PORT_WRCONFIG2_WRPMUX Write PMUX Registers **/
#define PORT_WRCONFIG2_WRPMUX		(1 << 28)

#define PORT_WRCONFIG2_PMUX_SHIFT		24
#define PORT_WRCONFIG2_PMUX_MASK		0x0f
/** @defgroup port_wrconfig2_pmux PMUX Peripheral Multiplexing Template
@{*/
/**@}*/

/** PORT_WRCONFIG2_DRVSTR Output Driver Strength Selection **/
#define PORT_WRCONFIG2_DRVSTR		(1 << 22)
/** PORT_WRCONFIG2_PULLEN Pull Enable **/
#define PORT_WRCONFIG2_PULLEN		(1 << 18)
/** PORT_WRCONFIG2_INEN Input Enable **/
#define PORT_WRCONFIG2_INEN		(1 << 17)
/** PORT_WRCONFIG2_PMUXEN Select Peripheral Multiplexer **/
#define PORT_WRCONFIG2_PMUXEN		(1 << 16)

#define PORT_WRCONFIG2_PINMASK_SHIFT		0
#define PORT_WRCONFIG2_PINMASK_MASK		0xffff
/** @defgroup port_wrconfig2_pinmask PINMASK Pin Mask for Multiple Pin Configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup port_evctrl2 EVCTRL2 Event Input Control
@{*/

/** PORT_EVCTRL2_PORTEI3 Port Event Enable Input 3 **/
#define PORT_EVCTRL2_PORTEI3		(1 << 31)

#define PORT_EVCTRL2_EVACT3_SHIFT		29
#define PORT_EVCTRL2_EVACT3_MASK		0x03
/** @defgroup port_evctrl2_evact3 EVACT3 Port Event Action 3
@{*/
/**@}*/


#define PORT_EVCTRL2_PID3_SHIFT		24
#define PORT_EVCTRL2_PID3_MASK		0x1f
/** @defgroup port_evctrl2_pid3 PID3 Port Event Pin Identifier 3
@{*/
/**@}*/

/** PORT_EVCTRL2_PORTEI2 Port Event Enable Input 2 **/
#define PORT_EVCTRL2_PORTEI2		(1 << 23)

#define PORT_EVCTRL2_EVACT2_SHIFT		21
#define PORT_EVCTRL2_EVACT2_MASK		0x03
/** @defgroup port_evctrl2_evact2 EVACT2 Port Event Action 2
@{*/
/**@}*/


#define PORT_EVCTRL2_PID2_SHIFT		16
#define PORT_EVCTRL2_PID2_MASK		0x1f
/** @defgroup port_evctrl2_pid2 PID2 Port Event Pin Identifier 2
@{*/
/**@}*/

/** PORT_EVCTRL2_PORTEI1 Port Event Enable Input 1 **/
#define PORT_EVCTRL2_PORTEI1		(1 << 15)

#define PORT_EVCTRL2_EVACT1_SHIFT		13
#define PORT_EVCTRL2_EVACT1_MASK		0x03
/** @defgroup port_evctrl2_evact1 EVACT1 Port Event Action 1
@{*/
/**@}*/


#define PORT_EVCTRL2_PID1_SHIFT		8
#define PORT_EVCTRL2_PID1_MASK		0x1f
/** @defgroup port_evctrl2_pid1 PID1 Port Event Pin Identifier 1
@{*/
/**@}*/

/** PORT_EVCTRL2_PORTEI0 Port Event Enable Input 0 **/
#define PORT_EVCTRL2_PORTEI0		(1 << 7)

#define PORT_EVCTRL2_EVACT0_SHIFT		5
#define PORT_EVCTRL2_EVACT0_MASK		0x03
/** @defgroup port_evctrl2_evact0 EVACT0 Port Event Action 0
@{*/
/**@}*/


